{
    "years": [2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022],
    "yearsText": [
        "In 2015 I joined the IDF. After basic training I went on a Computer Network Management course in Basmach, the IDF School for Computer Professions.<br/>After finishing the course with distinction I was assigned to Basmach's IT and DevOps department, which is considered one of the best in the IDF.",
        "In 2016 I was working on various different projects as part of my job in the IT and DevOps department of Basmach, most of them were scripting with PowerShell.<br/>Having access to all of Basmach's courses, I used my spare time to learn about Design and Programming, specifically Web Development.<br/>I started working on a website, where people from Basmach can find information about common technical issues and send tickets to our team. It was built with jQuery.",
        "In 2017 I was tasked with making the official website for Basmach.<br/>The success of the website made me even more passionate for Web Development, which led me to start learning Angular 1, and soon after that I switched to React.<br/>By that time I was also given some DevOps responsibilities, and I had learned about Linux, Docker and CI/CD.",
        "In 2018 I was assigned co-leader of the IT and DevOps department of Basmach.<br/>I was responsible for maintaining dozens of windows and linux servers and virtual machines, and for the provisioning of new servers whenever necessary.<br/>On March 2018 I left the IDF.",
        "On October 2019 I began studying Computer Science at the Academic College of Tel-Aviv Yaffo.<br/>On the first semester, I took courses in Group Theory, Calculus and Basic C Programming.",
        "On March 2020 I began the second semester studying Computer Science.<br/>I took courses in Calculus, Linear Algebra, Discrete Mathematics, Probability and Advanced C Programming.<br/>On October 2020 I began the third semester. I took courses in Computer Organization, Linear Algebra, Object Oriented Programming with C++, and Intro to Number Theory.",
        "On February 2021 I began the fourth semester studying Computer Science.<br/>I took courses in Data Structures, Assembly and Computer Architcture.<br/>On October 2021 I began the fifth semester. I took courses in Algorithms, Databases, Intro to Embedded Systems, and JavaScript with React.<br/>I also took a workshop in Entrepreneurship. The project I chose was building a website for a second-hand shop in Jaffa that is operated by a non-profit organization.",
        "On February 2022 I began the sixth semester studying Computer Science.<br/>I took courses in Computability, Operating Sysyems, Machine Learning with Python, Intro to Big Data and Randomized algorithms.<br/>I also took Deep Learning and VR Development courses in the summer.<br/>- That is all for now, I hope to keep learning and growing in the coming years!"
    ]
}
